<template>
    <AccountLayout>
        <div class="q-px-lg q-pb-md">
            <q-timeline color="secondary">
                <h5 class="q-mt-none">Ответы на часто задаваемые вопросы</h5>

                <q-timeline-entry v-for="item in items" :title="item.title" :body="item.body"/>
            </q-timeline>
        </div>
    </AccountLayout>
</template>

<script>
import AccountLayout from "../components/AccountLayout.vue";

export default {
    components: {AccountLayout},
    data() {
        return {
            items: [
                {
                    title: "Что такое дополненная реальность, или AR?",
                    body: "Дополненная реальность — это интерактивная версия реальности, обогащенная цифровыми изображениями, звуками и другими сигналами с помощью специальных технологий. AR-системы основаны на трех принципах: объединении цифровой и физической реальности, взаимодействии в реальном времени и точном 3D-разграничении реальных и виртуальных объектов."
                },
                {
                    title: "Что такое «безмаркерная» технология работы AR",
                    body: "«Безмаркерная» технология работает по особым алгоритмам распознавания, где на окружающий ландшафт, снятый камерой, накладывается виртуальная «сетка». На этой сетке программные алгоритмы находят некие опорные точки, по которым определяют точное место, к которому будет «привязана» виртуальная модель. Преимущество такой технологии в том, что объекты реального мира служат маркерами сами по себе и для них не нужно создавать специальных визуальных идентификаторов."
                },
                {
                    title: "Что такое AR технология на базе маркеров?",
                    body: "Технология на базе специальных маркеров, или меток, удобна тем, что они проще распознаются камерой и дают ей более жесткую привязку к месту для виртуальной модели. Такая технология гораздо надежнее «безмаркерной» и работает практически без сбоев."
                },
                {
                    title: "Что такое «пространственная» технология работы AR?",
                    body: "Кроме маркерной и безмаркерной, существует технология дополненной реальности, основанная на пространственном расположении объекта. В ней используются данные GPS/ГЛОНАСС, гироскопа и компаса, встроенного в мобильный телефон. Место виртуального объекта определяется координатами в пространстве. Активация программы дополненной реальности происходит при совпадении координаты, заложенной в программе, с координатами пользователя."
                }
            ],
        };
    }
}
</script>

<style scoped></style>
