<template>
    <div class="q-px-lg q-py-md">
        <q-timeline color="secondary">
            <h5 class="q-mt-lg">Ответы на часто задаваемые вопросы</h5>

            <q-timeline-entry v-for="item in items" :title="item.title" :body="item.body" />

        </q-timeline>
    </div>
</template>

<script>
export default {
    data() {
        return {
            items: [
                { title: "Где можно узнать какие объявления я создал(-а)?", body: "Чтобы увидеть все созданные вами объявления нажмите на значок аккаунта в правом верхнем углу и во всплывающем меню нажмите кнопку «Мои объекты»." },
                { title: "Как рассмотреть запросы на бронирование моих объектов", body: "Нажмите на значок аккаунта, расположенный в правом верхнем углу, далее в всплывающем меню на кнопку «Мои объекты» и перейдите на вкладку «Бронирование». Здесь отображаются заявки на бронирование ваших объектов. Нажмите кнопку «Рассмотреть» рядом с интересующей вас заявкой, отобразится информация о бронирование, вы может как подтвердить бронь, так и отклонить заявку" },
                { title: "Как включить/отключить почтовые рассылки и смс-уведомления на сайте?", body: "Нажмите на значок аккаунта в правом верхнем углу, затем кнопку «Аккаунт», затем перейдите на вкладку «Уведомления», здесь вы можете настраивать почтовые рассылки и смс-уведомления" },
                { title: "Где мне найти чек и договор аренды забронированного мной объекта?", body: "Чек и договор аренды по умолчанию отправляются на электронную почту указанную вами при регистрации." },
                { title: "Где я могу просмотреть информацию о забронированных мной объектах?", body: "В разделе «История аренды». Для этого авторизируйтесь, нажмите на значок аккаунта в правом верхнем углу, затем на кнопку «История аренды». На открывшейся вкладке отобразятся забронированные объекты, а так же забронированные ранее объекты." },
                { title: "Я создал(-а) объявление на сайте, но оно ни где ну отображается, что делать?", body: "Скорее всего, ваше объявление находится на модерации, мы рекомендуем вам подождать один, максимум два дня, если данная проблема не решиться, смело пишите в службу поддержки." },
                { title: "Я создал(-а) аккаунт на сайте, но не могу выложить объявление, в чем дело?", body: "Скорее всего, ваш аккаунт находится на проверке, дождитесь окончания проверки и подтверждения вашего аккаунт, это займет не более двух дней. Если спустя 2 дня вы все еще не можете выложить объявление, обращайтесь в службу поддержки." },
                { title: "Есть ли на сайте раздел, где я могу посмотреть о своих доходах со сдачи объектов в аренду?", body: "Нажмите на значок аккаунта в правом верхнем углу, в всплывающем меню нажмите кнопку «Мои объекты» и перейдите на вкладку финансы. На данной вкладке нажмите «Подробнее» рядом с интересующем вас объектом и вам отобразиться статистика доходов, а так же информация об аренде вашего объекта." },
                { title: "Я задал(-а) вопрос арендодателю, где я могу увидеть на него ответ?", body: "Когда вы задаете вопрос арендодателю, у вас появляется возможность пообщаться с ним в чате. Для этого войдите в свой аккаунт, нажмите синий значок чата в правом нижнем углу, затем выберете необходимый вам чат. " },

            ],

        };
    },
    name: "Helps"
}
</script>

<style scoped></style>
